1. От 1 до n
Дано натуральное число n. Выведите все числа от 1 до n.

func(int n) ->
    if n ==1
        return 1
    return (n-1)

2. Даны два целых числа A и В (каждое в отдельной строке).
Выведите все числа от A до B включительно, в порядке возрастания,
если A < B, или в порядке убывания в противном случае.

func (int a, int b) ->
    if(a > b) {
        if (a == b) {
            return a
        }
        return func(a-1, b)
    }
    else
        if (a == b) {
            return a
        }
        return func(a+1, b)

3. Факториал
Факториал целого числа N определяется как умножение всех чисел между 1 и N.
Напишите рекурсивную функцию factorial(), которая возвращает факториал ввода.
Протестируйте её с помощью первых 10 чисел.

n! => 1 * 2 * 3 * ...* (n-3) * (n-2) * (n-1) * n
0! = 1
1! = 1
3! = 1 * 2 * 3 = 6

long double factorial(int n)
{
    if(n < 0)
        return 0;
    if (n == 0)
        return 0;
    if (n == 1)
        return 1;
    else
        return factorial(n - 1) * factorial(n - 2);
}



4. Сумма цифр числа
Напишите рекурсивную функцию, которая принимает целое число в качестве входных
данных и возвращает сумму всех чисел этого значения (например: 542 = 5 + 4 + 2 = 11).
При решении этой задачи нельзя использовать строки, списки, массивы и циклы.
Протестируйте вашу программу, используя число 97 736 (результатом должно быть 32).

func(int n)
    if (n < 10)
        return n;
    else
        return n%10 + func(n/10);


5. Цифры числа справа налево
Дано натуральное число N. Выведите все его цифры по одной, в обратном порядке,
разделяя их пробелами или новыми строками.
При решении этой задачи нельзя использовать строки, списки, массивы и циклы.
Разрешена только рекурсия и целочисленная арифметика.

func(int n)
    if (n < 10)
        return n;
    else
        cout << n%10 << " ";
        return func(n/10);

6. Разворот числа
Дано число n, десятичная запись которого не содержит нулей. Получите число,
записанное теми же цифрами, но в противоположном порядке.
При решении этой задачи нельзя использовать циклы, строки, списки, массивы,
разрешается только рекурсия и целочисленная арифметика.
Фунция должна возвращать целое число, являющееся результатом работы программы,
выводить число по одной цифре нельзя.


условие (-> true/false) ? (true) run this part : (false) run this part
function (int n, int i) ->
    return (n == 0) ? i : function ( n/10, i*10 + n%10);

7. Перевод в 2 систему
1 часть.
Напишите программу, которая просит пользователя ввести целое число, а затем использует
рекурсивную функцию для вывода бинарного представления этого числа.
Предполагается, что число, которое введёт пользователь — положительное.

2 часть.
Обработайте случай, когда пользователь ввёл 0 или отрицательное число.