#include <iostream>

using namespace std;
//Напишите программу, которая рассчитывает среднее арифметическое 3-х чисел.
//Выведите результат на экран.

int main(){
    int a = 2, b = 5, c = 9; //int -> float/double
    cout << (double)(a + b + c)/3 << endl; //float

    return 0;
}