#include <iostream>

using namespace std;
//  Напишите программу, которая определяет символ с кодом 88.
int main(){
    //1
    cout << (char) 88 << endl;

    //2
    char c = 'X';
    cout << c << endl;
    cout << (int) c << endl;

    //3
    char a = 88;
    cout << a << endl;

    return 0;
}