/*
 * Task 1 // 02.02.2020
 *
 * Написать реализацию функции в "своем"
 * заголовочном файле, которая принимает
 * на вход имя пользователя и выводит:
 * 1. Приветствие;
 * 2. Количество символов в имени;
 * 3. Количество символов должно возвращаться
 * Далее Вы создаете рандомный массив чисел с
 * длиной массива из функции. Генерация рандомных
 * чисел должна быть реализована в отдельной функции
 * в основном файле (обязательно с прототипом!). Эта
 * функция будет напрямую вызываться в цикле при
 * заполнении массива.
 * После посчитать и вывести:
 * 1. среднее арифметическое массива
 * 2. сумму всех чисел
 * 3. сумму чисел кратных двум
 *
 *
 */

#include <iostream>
int main()
{

    return 0;
}

